pjclavero/Diana/firmware/esp32/sdkconfig.defaults
# Valores por defecto de ESP-IDF para Diana (ESP32-S3 + W5500).
# Se aplican con `idf.py set-target esp32s3 && idf.py build`.
#
# NOTA: este fichero NO se ha podido validar con un build real de ESP-IDF en el
# entorno donde se escribio (no hay toolchain instalado). Ver README.md.

CONFIG_IDF_TARGET="esp32s3"

# --- Particiones (partitions.csv: OTA A/B + NVS + cola de eventos) ----------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# --- Ethernet W5500 por SPI (dosier 8.3) ------------------------------------
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
CONFIG_ETH_USE_ESP32_EMAC=n

# --- MQTT --------------------------------------------------------------------
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TASK_STACK_SIZE=6144

# --- Watchdog (dosier 8.2): obligatorio y con panic, no solo aviso ----------
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# --- Registro de fallos: volcado en flash para diagnosticar reinicios -------
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_SHA256=y

# --- OTA: rollback automatico si la imagen nueva no se confirma -------------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_WDT_TIME_MS=9000

# --- Firma de aplicacion (dosier 13.6, 23.3) --------------------------------
# BRING-UP PROTOTIPO: no se fuerza firma porque la clave privada NO debe vivir
# en el repositorio. Produccion/OTA debe reactivar estas opciones con una clave
# provisionada fuera del arbol de Git.
CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=n
CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=n

# --- Cifrado de NVS ----------------------------------------------------------
# BRING-UP PROTOTIPO: no se fuerza cifrado NVS porque requiere provisionar
# claves/eFuses en la placa. Produccion debe reactivar esta opcion antes de
# almacenar credenciales MQTT reales.
CONFIG_NVS_ENCRYPTION=n

# --- PSRAM (placa de desarrollo con octal SPI RAM) --------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Reloj y temporizacion: la resolucion de 1 ms del dosier 14.2 exige que
#     esp_timer sea la fuente monotonica, no los ticks de FreeRTOS -----------
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
